# Brewfile

# Formulae
brew "git"               # バージョン管理ツール
brew "node"              # JavaScript ランタイム
brew "typescript-language-server"  # TypeScript LSP サーバー
brew "cmake"             # ビルドシステム
brew "gcc"               # コンパイラ
brew "neovim"            # テキストエディタ
brew "tmux"              # 端末マルチプレクサ
brew "wget"              # ファイルダウンロードツール
brew "curl"              # データ転送ツール
brew "openssl@1.1"       # 暗号化ライブラリ
brew "zsh"               # シェル
brew "jq"                # JSON プロセッサ
brew "tree"              # ディレクトリ構造表示ツール
brew "ranger"            # TUI ファイル管理アプリケーション
brew "claude-code"
brew "gh"                # Github Cli
brew "direnv"            # ディレクトリごとの環境変数管理
brew "go"                # Go プログラミング言語
brew "gopls"             # Go LSP サーバー
brew "lua-language-server"  # Lua LSP サーバー
brew "fish"              # Fish シェル（Neovim の shell オプションで使用）

# Casks
cask "google-cloud-sdk"
cask "chromedriver"
cask "ngrok"
cask "ghostty"
cask "wezterm"
cask "font-hackgen-nerd"
