# Brewfile

# Formulae
brew "git"               # バージョン管理ツール
brew "node"              # JavaScript ランタイム
brew "python@3.9"        # Python プログラミング言語
brew "cmake"             # ビルドシステム
brew "gcc"               # コンパイラ
brew "neovim"            # テキストエディタ
brew "ripgrep"           # 迅速な検索ツール
brew "tmux"              # 端末マルチプレクサ
brew "htop"              # システムモニタ
brew "wget"              # ファイルダウンロードツール
brew "curl"              # データ転送ツール
brew "fzf"               # ファジーファインダー
brew "openssl@1.1"       # 暗号化ライブラリ
brew "zsh"               # シェル
brew "jq"                # JSON プロセッサ
brew "tree"              # ディレクトリ構造表示ツール
brew "bat"               # cat コマンドの代替
brew "ranger"            # TUI ファイル管理アプリケーション
# Casks
cask "alacritty"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "gpg-suite"
cask "chromedriver"
cask "ngrok"
cask "vagrant"
