# Brewfile

# ==============================
# Taps
# ==============================
tap "oven-sh/bun"        # Bun JavaScript ランタイム

# ==============================
# シェル・ターミナル
# ==============================
brew "zsh"               # シェル
brew "tmux"              # 端末マルチプレクサ
brew "starship"          # プロンプトテーマ
brew "direnv"            # ディレクトリごとの環境変数管理
brew "reattach-to-user-namespace"  # tmux でのクリップボード連携（macOS）

# ==============================
# エディタ・開発ツール
# ==============================
brew "neovim"            # テキストエディタ
brew "git"               # バージョン管理ツール
brew "git-filter-repo"   # Git 履歴操作ツール
brew "gh"                # GitHub CLI
brew "ghq"               # Git リポジトリ管理ツール
brew "lazygit"           # Git TUI クライアント
brew "act"               # GitHub Actions ローカル実行

# ==============================
# 言語・ランタイム
# ==============================
brew "node"              # JavaScript ランタイム
brew "bun"               # JavaScript ランタイム/バンドラ
brew "typescript"        # TypeScript コンパイラ
brew "go"                # Go プログラミング言語
brew "pyenv"             # Python バージョン管理
brew "cmake"             # ビルドシステム
brew "gcc"               # コンパイラ

# ==============================
# LSP サーバー
# ==============================
brew "typescript-language-server"  # TypeScript LSP サーバー
brew "gopls"             # Go LSP サーバー
brew "lua-language-server"  # Lua LSP サーバー
brew "terraform-ls"      # Terraform LSP サーバー

# ==============================
# CLI ユーティリティ
# ==============================
brew "fzf"               # あいまい検索ツール
brew "zoxide"            # スマートディレクトリ移動ツール
brew "wget"              # ファイルダウンロードツール
brew "curl"              # データ転送ツール
brew "jq"                # JSON プロセッサ
brew "tree"              # ディレクトリ構造表示ツール
brew "ranger"            # TUI ファイル管理アプリケーション
brew "duckdb"            # 分析用データベースエンジン
brew "cloudflared"       # Cloudflare トンネルクライアント
brew "gogcli"            # Google OAuth CLI（OpenClaw 連携用）
brew "openssl@3"         # 暗号化ライブラリ

# ==============================
# Casks（GUI アプリ・フォント）
# ==============================
cask "wezterm"           # ターミナルエミュレータ（メイン）
cask "ghostty"           # ターミナルエミュレータ
cask "gcloud-cli"        # Google Cloud SDK
cask "chromedriver"      # Chrome 自動化ドライバ
cask "ngrok"             # トンネリングツール
cask "1password-cli"     # 1Password CLI
cask "font-hackgen-nerd" # HackGen Nerd フォント
cask "font-udev-gothic-nf"  # UDEV Gothic Nerd フォント
